Masmiseim36/nxpSDK/devices/MKV46F16/cmsis_drivers/fsl_dspi_cmsis.c
    switch (control & ARM_SPI_CONTROL_Msk)
    {
        case ARM_SPI_MODE_INACTIVE:
            DSPI_Enable(dspi->resource->base, false);
            return ARM_DRIVER_OK;

        case ARM_SPI_MODE_MASTER: /* SPI Master (Output on SOUT, Input on SIN); arg = Bus Speed in bps */
            DSPI_SetMasterSlaveMode(dspi->resource->base, kDSPI_Master);
            memset((dspi->edmaRxRegToRxDataHandle), 0, sizeof(edma_handle_t));
            memset((dspi->edmaTxDataToIntermediaryHandle), 0, sizeof(edma_handle_t));
            memset((dspi->edmaIntermediaryToTxRegHandle), 0, sizeof(edma_handle_t));

            EDMA_CreateHandle(dspi->edmaRxRegToRxDataHandle, dmaResource->rxEdmaBase, dmaResource->rxEdmaChannel);
            DMAMUX_SetSource(dmaResource->rxDmamuxBase, dmaResource->rxEdmaChannel, dmaResource->rxDmaRequest);
            DMAMUX_EnableChannel(dmaResource->rxDmamuxBase, dmaResource->rxEdmaChannel);

            EDMA_CreateHandle(dspi->edmaTxDataToIntermediaryHandle, dmaResource->txEdmaBase,
                              dmaResource->txEdmaChannel);

            EDMA_CreateHandle(dspi->edmaIntermediaryToTxRegHandle, dmaResource->masterLinkEdmaBase,
                              dmaResource->masterLinkChannel);

            if (1 == FSL_FEATURE_DSPI_HAS_SEPARATE_DMA_RX_TX_REQn(dspi->resource->base))
            {
                DMAMUX_SetSource(dmaResource->txDmamuxBase, dmaResource->masterLinkChannel, dmaResource->txDmaRequest);
                DMAMUX_EnableChannel(dmaResource->txDmamuxBase, dmaResource->masterLinkChannel);
            }
            DSPI_MasterTransferCreateHandleEDMA(dspi->resource->base, &(dspi->handle->masterHandle),
                                                KSDK_DSPI_MasterEdmaCallback, (void *)dspi->event,
                                                (dspi->edmaRxRegToRxDataHandle), (dspi->edmaTxDataToIntermediaryHandle),
                                                (dspi->edmaIntermediaryToTxRegHandle));

            dspi->baudRate_Bps = arg;
            dspi->flags |= SPI_FLAG_CONFIGURED;

            break;

        case ARM_SPI_MODE_SLAVE: /* SPI Slave  (Output on SOUT, Input on SIN) */
            DSPI_SetMasterSlaveMode(dspi->resource->base, kDSPI_Slave);
            memset(dspi->edmaRxRegToRxDataHandle, 0, sizeof(edma_handle_t));
            memset(dspi->edmaTxDataToTxRegHandle, 0, sizeof(edma_handle_t));

            EDMA_CreateHandle(dspi->edmaTxDataToTxRegHandle, dmaResource->txEdmaBase, dmaResource->txEdmaChannel);
            if (1 == FSL_FEATURE_DSPI_HAS_SEPARATE_DMA_RX_TX_REQn(dspi->resource->base))
            {
                DMAMUX_SetSource(dmaResource->txDmamuxBase, dmaResource->txEdmaChannel, dmaResource->txDmaRequest);
                DMAMUX_EnableChannel(dmaResource->txDmamuxBase, dmaResource->txEdmaChannel);
            }

            EDMA_CreateHandle(dspi->edmaRxRegToRxDataHandle, dmaResource->rxEdmaBase, dmaResource->rxEdmaChannel);
            DMAMUX_SetSource(dmaResource->rxDmamuxBase, dmaResource->rxEdmaChannel, dmaResource->rxDmaRequest);
            DMAMUX_EnableChannel(dmaResource->rxDmamuxBase, dmaResource->rxEdmaChannel);

            DSPI_SlaveTransferCreateHandleEDMA(dspi->resource->base, &(dspi->handle->slaveHandle),
                                               KSDK_DSPI_SlaveEdmaCallback, (void *)dspi->event,
                                               (dspi->edmaRxRegToRxDataHandle), (dspi->edmaTxDataToTxRegHandle));

            dspi->flags |= SPI_FLAG_CONFIGURED;
            break;

        case ARM_SPI_SET_BUS_SPEED: /* Set Bus Speed in bps; */
            if (!DSPI_IsMaster(dspi->resource->base))
            {
                return ARM_DRIVER_ERROR_UNSUPPORTED;
            }

            if (0 == DSPI_MasterSetBaudRate(dspi->resource->base, kDSPI_Ctar0, arg, dspi->resource->GetFreq()))
            {
                return ARM_DRIVER_ERROR;
            }

            dspi->baudRate_Bps = arg;
            return ARM_DRIVER_OK;

        case ARM_SPI_GET_BUS_SPEED: /* Set Bus Speed in bps; arg = value */
            if (!DSPI_IsMaster(dspi->resource->base))
            {
                return ARM_DRIVER_ERROR_UNSUPPORTED;
            }

            return dspi->baudRate_Bps;

        case ARM_SPI_CONTROL_SS: /* Control Slave Select; arg = 0:inactive, 1:active  */
            return ARM_DRIVER_ERROR_UNSUPPORTED;

        case ARM_SPI_ABORT_TRANSFER: /* Abort current data transfer */
            if (DSPI_IsMaster(dspi->resource->base))
            {
                DSPI_MasterTransferAbortEDMA(dspi->resource->base, &dspi->handle->masterHandle);
            }
            else
            {
                DSPI_SlaveTransferAbortEDMA(dspi->resource->base, &dspi->handle->slaveHandle);
            }
            return ARM_DRIVER_OK;

        case ARM_SPI_SET_DEFAULT_TX_VALUE: /* Set default Transmit value; arg = value */
            DSPI_SetDummyData(dspi->resource->base, (uint8_t)arg);
            return ARM_DRIVER_OK;

        case ARM_SPI_MODE_MASTER_SIMPLEX: /* SPI Master (Output/Input on MOSI); arg = Bus Speed in bps */
            /* Mode is not supported by current driver. */
            return ARM_DRIVER_ERROR_UNSUPPORTED;

        case ARM_SPI_MODE_SLAVE_SIMPLEX: /* SPI Slave  (Output/Input on MISO) */
            /* Mode is not supported by current driver. */
            return ARM_DRIVER_ERROR_UNSUPPORTED;

        default:
            break;
    }

    return DSPI_CommonControl(control, dspi->baudRate_Bps, dspi->resource, &dspi->flags);
}

ARM_SPI_STATUS DSPI_EdmaGetStatus(cmsis_dspi_edma_driver_state_t *dspi)
{
    ARM_SPI_STATUS stat;
    uint32_t ksdk_dspi_status = DSPI_GetStatusFlags(dspi->resource->base);

    if (DSPI_IsMaster(dspi->resource->base))
    {
        stat.busy = (kDSPI_Busy == dspi->handle->masterHandle.state) ? (1U) : (0U);
    }
    else
    {
        stat.busy = (kDSPI_Busy == dspi->handle->slaveHandle.state) ? (1U) : (0U);
    }

    stat.data_lost =
        ((ksdk_dspi_status & kDSPI_TxFifoUnderflowFlag) || (ksdk_dspi_status & kDSPI_RxFifoOverflowFlag)) ? (1U) : (0U);
    stat.mode_fault = 0U;
    stat.reserved   = 0U;

