Masmiseim36/nxpSDK/devices/MKV46F16/cmsis_drivers/fsl_dspi_cmsis.c
    return stat;
}
#endif /* defined(FSL_FEATURE_SOC_EDMA_COUNT) */

#endif

#if ((RTE_SPI0 && !RTE_SPI0_DMA_EN) || (RTE_SPI1 && !RTE_SPI1_DMA_EN) || (RTE_SPI2 && !RTE_SPI2_DMA_EN))

void KSDK_DSPI_MasterInterruptCallback(SPI_Type *base, dspi_master_handle_t *handle, status_t status, void *userData)
{
    uint32_t event = 0U;

    if (kStatus_Success == status)
    {
        event = ARM_SPI_EVENT_TRANSFER_COMPLETE;
    }

    if (kStatus_DSPI_Error == status)
    {
        event = ARM_SPI_EVENT_DATA_LOST;
    }
    /* User data is actually CMSIS driver callback. */
    if ((0U != event) && (userData))
    {
        ((ARM_SPI_SignalEvent_t)userData)(event);
    }
}
void KSDK_DSPI_SlaveInterruptCallback(SPI_Type *base, dspi_slave_handle_t *handle, status_t status, void *userData)
{
    uint32_t event = 0U;

    if (kStatus_Success == status)
    {
        event = ARM_SPI_EVENT_TRANSFER_COMPLETE;
    }

    if (kStatus_DSPI_Error == status)
    {
        event = ARM_SPI_EVENT_DATA_LOST;
    }
    /* User data is actually CMSIS driver callback. */
    if ((0U != event) && (userData))
    {
        ((ARM_SPI_SignalEvent_t)userData)(event);
    }
}

static int32_t DSPI_InterruptInitialize(ARM_SPI_SignalEvent_t cb_event, cmsis_dspi_interrupt_driver_state_t *dspi)
{
    if (!(dspi->flags & SPI_FLAG_INIT))
    {
        dspi->event = cb_event;
        dspi->flags = SPI_FLAG_INIT;
    }
    return ARM_DRIVER_OK;
}

static int32_t DSPI_InterruptUninitialize(cmsis_dspi_interrupt_driver_state_t *dspi)
{
    dspi->flags = SPI_FLAG_UNINIT;
    return ARM_DRIVER_OK;
}

static int32_t DSPI_InterruptPowerControl(ARM_POWER_STATE state, cmsis_dspi_interrupt_driver_state_t *dspi)
{
    switch (state)
    {
        case ARM_POWER_OFF:
            if (dspi->flags & SPI_FLAG_POWER)
            {
                DSPI_Deinit(dspi->resource->base);
                dspi->flags = SPI_FLAG_INIT;
            }
            break;

        case ARM_POWER_LOW:
            return ARM_DRIVER_ERROR_UNSUPPORTED;

        case ARM_POWER_FULL:
            if (dspi->flags == SPI_FLAG_UNINIT)
            {
                return ARM_DRIVER_ERROR;
            }

            if (dspi->flags & SPI_FLAG_POWER)
            {
                /* Driver already powered */
                break;
            }

            CLOCK_EnableClock(s_dspiClock[dspi->resource->instance]);
            dspi->flags |= SPI_FLAG_POWER;

            break;
        default:
            return ARM_DRIVER_ERROR_UNSUPPORTED;
    }
    return ARM_DRIVER_OK;
}

static int32_t DSPI_InterruptSend(const void *data, uint32_t num, cmsis_dspi_interrupt_driver_state_t *dspi)
{
    int32_t ret;
    status_t status;
    dspi_transfer_t xfer = {0};
    uint32_t datawidth   = (dspi->resource->base->CTAR[kDSPI_MasterCtar0] & SPI_CTAR_FMSZ_MASK) >> SPI_CTAR_FMSZ_SHIFT;

    xfer.rxData   = NULL;
    xfer.txData   = (uint8_t *)data;
    xfer.dataSize = num * ((datawidth + 8U) / 8U);

    if (DSPI_IsMaster(dspi->resource->base))
    {
#if (defined(RTE_SPI0_MASTER_PCS_PIN_SEL))
        if (0U == dspi->resource->instance)
        {
            xfer.configFlags = kDSPI_MasterCtar0 | RTE_SPI0_MASTER_PCS_PIN_SEL;
        }
#endif /* DSPI0 PCS select configuration */
#if (defined(RTE_SPI1_MASTER_PCS_PIN_SEL))
        if (1U == dspi->resource->instance)
        {
            xfer.configFlags = kDSPI_MasterCtar0 | RTE_SPI1_MASTER_PCS_PIN_SEL;
        }
#endif /* DSPI1 PCS select configuration */
#if (defined(RTE_SPI2_MASTER_PCS_PIN_SEL))
        if (2U == dspi->resource->instance)
        {
            xfer.configFlags = kDSPI_MasterCtar0 | RTE_SPI2_MASTER_PCS_PIN_SEL;
        }
#endif /* DSPI2 PCS select configuration */
    }
    else
    {
        /* DSPI slave use Ctar0 setting and slave can only use PCS0. */
        xfer.configFlags = kDSPI_SlaveCtar0;
    }

    if (DSPI_IsMaster(dspi->resource->base))
    {
        status = DSPI_MasterTransferNonBlocking(dspi->resource->base, &dspi->handle->masterHandle, &xfer);
    }
    else
    {
        status = DSPI_SlaveTransferNonBlocking(dspi->resource->base, &dspi->handle->slaveHandle, &xfer);
    }

    switch (status)
    {
        case kStatus_Success:
            ret = ARM_DRIVER_OK;
            break;
        case kStatus_InvalidArgument:
            ret = ARM_DRIVER_ERROR_PARAMETER;
            break;
        case kStatus_DSPI_Busy:
            ret = ARM_DRIVER_ERROR_BUSY;
            break;
        default:
            ret = ARM_DRIVER_ERROR;
            break;
    }

    return ret;
}

static int32_t DSPI_InterruptReceive(void *data, uint32_t num, cmsis_dspi_interrupt_driver_state_t *dspi)
{
    int32_t ret;
    status_t status;
    dspi_transfer_t xfer = {0};
    uint32_t datawidth   = (dspi->resource->base->CTAR[kDSPI_MasterCtar0] & SPI_CTAR_FMSZ_MASK) >> SPI_CTAR_FMSZ_SHIFT;

    xfer.txData   = NULL;
    xfer.rxData   = (uint8_t *)data;
    xfer.dataSize = num * ((datawidth + 8U) / 8U);

    if (DSPI_IsMaster(dspi->resource->base))
    {
#if (defined(RTE_SPI0_MASTER_PCS_PIN_SEL))
        if (0U == dspi->resource->instance)
        {
            xfer.configFlags = kDSPI_MasterCtar0 | RTE_SPI0_MASTER_PCS_PIN_SEL;
        }
#endif /* DSPI0 PCS select configuration */
#if (defined(RTE_SPI1_MASTER_PCS_PIN_SEL))
        if (1U == dspi->resource->instance)
        {
            xfer.configFlags = kDSPI_MasterCtar0 | RTE_SPI1_MASTER_PCS_PIN_SEL;
        }
#endif /* DSPI1 PCS select configuration */
#if (defined(RTE_SPI2_MASTER_PCS_PIN_SEL))
        if (2U == dspi->resource->instance)
        {
            xfer.configFlags = kDSPI_MasterCtar0 | RTE_SPI2_MASTER_PCS_PIN_SEL;
        }
#endif /* DSPI2 PCS select configuration */
    }
    else
    {
        /* DSPI slave use Ctar0 setting and slave can only use PCS0. */
        xfer.configFlags = kDSPI_SlaveCtar0;
    }

    if (DSPI_IsMaster(dspi->resource->base))
    {
        status = DSPI_MasterTransferNonBlocking(dspi->resource->base, &dspi->handle->masterHandle, &xfer);
    }
    else
    {
        status = DSPI_SlaveTransferNonBlocking(dspi->resource->base, &dspi->handle->slaveHandle, &xfer);
    }

    switch (status)
    {
        case kStatus_Success:
            ret = ARM_DRIVER_OK;
            break;
        case kStatus_InvalidArgument:
            ret = ARM_DRIVER_ERROR_PARAMETER;
            break;
        case kStatus_DSPI_Busy:
            ret = ARM_DRIVER_ERROR_BUSY;
            break;
        default:
            ret = ARM_DRIVER_ERROR;
            break;
    }

    return ret;
}

static int32_t DSPI_InterruptTransfer(const void *data_out,
                                      void *data_in,
                                      uint32_t num,
                                      cmsis_dspi_interrupt_driver_state_t *dspi)
{
    int32_t ret;
    status_t status;
    dspi_transfer_t xfer = {0};
    uint32_t datawidth   = (dspi->resource->base->CTAR[kDSPI_MasterCtar0] & SPI_CTAR_FMSZ_MASK) >> SPI_CTAR_FMSZ_SHIFT;

    xfer.txData   = (uint8_t *)data_out;
    xfer.rxData   = (uint8_t *)data_in;
    xfer.dataSize = num * ((datawidth + 8U) / 8U);

    if (DSPI_IsMaster(dspi->resource->base))
    {
#if (defined(RTE_SPI0_MASTER_PCS_PIN_SEL))
        if (0U == dspi->resource->instance)
        {
            xfer.configFlags = kDSPI_MasterCtar0 | RTE_SPI0_MASTER_PCS_PIN_SEL;
        }
#endif /* DSPI0 PCS select configuration */
#if (defined(RTE_SPI1_MASTER_PCS_PIN_SEL))
        if (1U == dspi->resource->instance)
        {
            xfer.configFlags = kDSPI_MasterCtar0 | RTE_SPI1_MASTER_PCS_PIN_SEL;
        }
#endif /* DSPI1 PCS select configuration */
#if (defined(RTE_SPI2_MASTER_PCS_PIN_SEL))
        if (2U == dspi->resource->instance)
        {
            xfer.configFlags = kDSPI_MasterCtar0 | RTE_SPI2_MASTER_PCS_PIN_SEL;
        }
#endif /* DSPI2 PCS select configuration */
    }
    else
    {
        /* DSPI slave use Ctar0 setting and slave can only use PCS0. */
        xfer.configFlags = kDSPI_SlaveCtar0;
    }

    if (DSPI_IsMaster(dspi->resource->base))
    {
        status = DSPI_MasterTransferNonBlocking(dspi->resource->base, &dspi->handle->masterHandle, &xfer);
    }
    else
    {
        status = DSPI_SlaveTransferNonBlocking(dspi->resource->base, &dspi->handle->slaveHandle, &xfer);
    }

    switch (status)
    {
        case kStatus_Success:
            ret = ARM_DRIVER_OK;
            break;
        case kStatus_InvalidArgument:
            ret = ARM_DRIVER_ERROR_PARAMETER;
            break;
        case kStatus_DSPI_Busy:
            ret = ARM_DRIVER_ERROR_BUSY;
            break;
        default:
            ret = ARM_DRIVER_ERROR;
            break;
    }

    return ret;
}
static uint32_t DSPI_InterruptGetCount(cmsis_dspi_interrupt_driver_state_t *dspi)
{
    uint8_t cnt;
    uint32_t datawidth = (dspi->resource->base->CTAR[kDSPI_MasterCtar0] & SPI_CTAR_FMSZ_MASK) >> SPI_CTAR_FMSZ_SHIFT;

    if (DSPI_IsMaster(dspi->resource->base))
    {
        cnt = dspi->handle->masterHandle.totalByteCount - dspi->handle->masterHandle.remainingReceiveByteCount;
    }
    else
    {
        cnt = dspi->handle->slaveHandle.totalByteCount - dspi->handle->slaveHandle.remainingReceiveByteCount;
    }
    cnt /= ((datawidth + 8U) / 8U);

    return cnt;
}

static int32_t DSPI_InterruptControl(uint32_t control, uint32_t arg, cmsis_dspi_interrupt_driver_state_t *dspi)
{
    if (!(dspi->flags & SPI_FLAG_POWER))
    {
        return ARM_DRIVER_ERROR;
    }

